{  "name": "GW-API-v2 (S2S)",  "version": "2.0.0",  "description": "Documentation for the GrowishPay API V2 (S2S Branch)",  "title": "GrowishPay API V2",  "header": {    "title": "Introduction",    "content": "<h2>Introduction</h2>\n<h3>Base URL</h3>\n<p><strong>Production</strong>: https://api.growish.com/v2/:domain</p>\n<p><strong>Sandbox</strong>: https://apidev.growish.com/v2/:domain</p>\n<hr>\n<h3>Authentication</h3>\n<p>The server to server version of this API uses Basic Auth. In basic HTTP authentication,\na request contains a header field in the form of Authorization: Basic <credentials>,\nwhere credentials is the Base64 encoding of ID and password joined by a single colon :.</p>\n<p><em>Before using any of the environments you need to contact a sales representative from\nGrowishPay, he or she will provide you with test credentials.</em></p>\n<hr>\n<h3>Security</h3>\n<p>The sandbox environment allows connections from any IPs but forces you to use SSL as is mandatory\nto protect your credentials. In Production a whitelist is generated with the IPs of your server\nclients and mutual SSL authentication is available. <strong>THIS IS A BACKEND API. DO NOT MAKE CALLS FROM\nYOUR FRONTEND.</strong></p>\n<hr>\n<h3>Domain</h3>\n<p>Your base URL contains a :domain variable, it will be given to you by a GrowishPay consultant along\nwith your credentials.</p>\n<p>   </p>\n<hr>\n<h3>How to use the GrowishPay REST API</h3>\n<p>We designed the API in a very RESTful way, so that your user experience is simple and straightforward.</p>\n<p>You are able to:</p>\n<ul>\n<li>Submit data requires an HTTP POST request</li>\n<li>Retrieve data requires an HTTP GET request</li>\n<li>Change data requires an HTTP PUT request</li>\n</ul>\n<p>Requests must be sent using <code>Content-Type &quot;application/json&quot;</code>. The request and response body encoding is always UTF-8.</p>\n<hr>\n<h3>Formats used</h3>\n<p>IDs: <a href=\"https://docs.mongodb.com/manual/reference/method/ObjectId/\">Mongo ObjectId</a></p>\n<p>Dates: <a href=\"https://en.wikipedia.org/wiki/ISO_8601\">ISO Date</a></p>\n<p>Amounts: <code>Int</code> in cents</p>\n<p>Sensitive case: <code>The fields and parameter names in requests are case sensitive</code></p>\n<hr>\n<h3>Work in progress</h3>\n<p>This documentation is still in progress, many others features are being develop and documented\nlike webhooks to notify your client when payment requests are fulfill. Please check this documentation\noften for updates.</p>\n"  },  "order": [    "Users",    "Wallets",    "PayIns",    "Transfers",    "PayOuts",    "Transactions",    "Get",    "Save",    "Update",    "List"  ],  "sampleUrl": false,  "defaultVersion": "0.0.0",  "apidoc": "0.3.0",  "generator": {    "name": "apidoc",    "time": "2021-08-13T15:22:25.155Z",    "url": "http://apidocjs.com",    "version": "0.17.7"  }}
